#Вычислите значение выражения (a+4b)(a−3b)+a2 при a=2 и b=3

a=2
b=3
print ((a+4*b)*(a-3*b)+a**2)
